{"title": "What was the dumbest thing you’ve ever been asked by a customer?", "score": "4.8k", "url": "https://www.reddit.com/r/AskReddit/comments/e8rmpo/what_was_the_dumbest_thing_youve_ever_been_asked/", "created": "1 day", "comments": [{"author": "albatross34", "score": "4.3k", "created": "20 hours", "comment": "I used to work at Enterprise Rent-A-Car (We'll pick you up!).  I went to pick up a customer (worth noting she was renting a car for a weekend getaway), called her when I got to her apt, and she came downstairs and had this conversation:\n\nLady: Ok, I'll follow you back to the office\n\nMe (confused): I'm here to pick you up and drive you back to the office.\n\nLady: What am I supposed to do with my car?\n\nMe: Were you planning on leaving your car at our lot over the weekend?\n\nLady: No\n\nMe (more confused): Why are you going to follow me in your car?  I can drive you back to the office, finish the paperwork, and you can take the rental car from there.\n\nLady (not grasping the concept): Well how are you going to get back?\n\nMe: I'll drive us both, in this rental car, back to the office, where we can do the paperwork and you can take the rental car from there.  That way, your personal car is still at your apt.  And when you return the car on Monday, you can drive the rental car back to us, we'll close out the paperwork, and we'll give you a ride home.  Sound like a plan?\n\nLady: That doesn't make sense.  You're making this way too difficult.  I'll just follow you in my car.\n\nMe (thinking the customer is always right!): Ok!\n\nWe get back to the office, I finish the paperwork (still astonished she qualified to rent a car), and hand her the keys to the car.\n\nLady: Ok, how do I get my car back to my apt?\n\nMe: ...\n\nLady: Can you drive my car back to my apt?\n\nMe: I'm not authorized to drive your car.  You're welcome to leave it here on the lot over the weekend if you want.\n\nLady: Ok, can you drive the rental car and follow me back to my house so I can drop off my car?\n\nMe: This is what I was trying to do when I picked you up!  There was no need to take 2 cars.\n\nLady: I'd like to speak to your manager."}, {"author": "BLOOBERRYBOY", "score": "2.5k", "created": "20 hours", "comment": "Context - I was 16 during this \n\nI work at chick fil a and I’m taking orders as you do, guy walks up and asks “Aren’t you supposed to be in school?”. I look down at the clock and see it’s 6 pm. I look at him confused and say “No it’s 6 pm”. He asks again, I say the same thing again. \n\nThen he yells “Alright, FUCK YOU” and leaves"}, {"author": "RedPlanit", "score": "4.0k", "created": "20 hours", "comment": "I used to work at the UPS store in high school. Our last pickup was at 7:00 and we closed at 8:00 pm. Since we had private information and people’s personal mailboxes in the store, security was a big deal.\n\nIt was 8:30. Our tills were counted down, the alarm was set, our copiers, fax machine, and computers were shut down, our lights were off, and we had closed and locked a ginormous red gate that separated the entrance from the rest of the store. \n\nSome woman ran up to the door, and like some demon in a horror movie, she hurled herself against the glass and screeched like a banshee.\n\nKeep in mind, we are very obviously closed with a sign saying we are closed, no lights on, and a giant red gate drawn down over the store. \n\nShe began pounding on the glass and frantically yelling at us. My coworker worried something was wrong, like maybe she was being chased and needed help. \n\nHe carefully opened the door just a crack to ask what was wrong. She immediately tried to wedge her hands and head in the crack and asked “Are ya’ll open?”  We informed her that we obviously weren’t. \n\nHer logic was “well you opened the door so now you have to help me”. \n\nShe began wailing and crying that she had to mail a package. We explained that even if we were open, our last pick up was an hour and a half ago and we couldn’t even mail it until tomorrow. \n\nShe protested and protested and we eventually got the door shut and locked. So we just stood there awkwardly in the dark, hoping she would leave. She kept pounding on the glass and saying “I know you’re open!!!!”\n\nAs we debated what to do and if we should call the cops, this lady pulled out her cell phone and called the cops herself!\n\nThe cops arrived, we explained the situation, and the woman accused us of lying, despite the sign on the door saying we closed an hour ago at this point. \n\nThen, in front of the officer and on security camera, the woman launched herself at my coworker and hit him in the face. She immediately jumped back and began fake crying that he had assaulted her. \n\nWe were dumbfounded. She ended up getting arrested and my coworker pressed charges.\n\n\nSo the stupidest question I got was “Are you open?”."}, {"author": "dragnansdragon", "score": "3.0k", "created": "23 hours", "comment": "When I was a teenager I had a customer try to fight me because we didn't do the taco Tuesday discount for him. \n\nIt was the weekend"}, {"author": "StupidSexxxyFlanders", "score": "4.7k", "created": "23 hours", "comment": "I used to work in a pet store. One night a woman came in and said she had ordered a puppy off the internet and he would be arriving in the next few days. She had never owned a pet and asked several dumb questions, but the one that I'll always remember is \"Do puppies need water?\""}, {"author": "Ahead_of_the_Storm", "score": "2.8k", "created": "23 hours", "comment": "When I worked in a call center for home phone service, I had a guy call and angrily ask why we were still charging him for his phone service, since he had unplugged his phone from the wall a month ago."}, {"author": "rosecitywanderer86", "score": "619", "created": "22 hours", "comment": "Not necessarily a dumb question, per se but by far the most memorable dumb customer encounter. Years ago I worked for an Audi dealership as a greeter/shuttle driver and one blissfully quiet afternoon, a middle aged woman in a beige A6 pulled into the drive. Here's how the exchange went down:\n\nMe: Good afternoon. How can I help you today?\n\nHer: This light came on! (She points to the check engine light with concern in her voice)\n\nMe: Yes. That's the check engine light...\n\nHer (interrupting me): No! It's this one!!! (the CEL was the only light on at this point in time)\n\nMe: Yes. That's the check engine light.\n\nHer: Well what does it mean?\n\nMe: There are literally thousands of different things that can turn that light on but if you go into the office there, one of our service advisors can plug in a little computer and they'll tell you what's wrong. \n\nHer: (scoffs condescendingly) So you don't know what it means...\n\nMe: Ma'am I think they can help you better than I."}, {"author": "SlytherinGirl125", "score": "3.4k", "created": "23 hours", "comment": "I used to work in a phone shop.   \nHad someone come in asking why their phone wasn't working properly. It was visibly scorched and melty. I asked why it looked that way. They said, it came up with an error message saying it had been too cold (not an error message I had heard of before, but I know phones can bring up errors for being too hot, so who knows) and so they had put it under the grill to heat it up.   \nThe grill.   \nTheir first point of call was to cook it.  \nI said, that's why their phone wasn't working, and no it was not covered under the guarantee."}, {"author": "justanotherpolyglott", "score": "3.6k", "created": "1 day", "comment": "A woman came to the check out and handed me a bag of mozzarella. She asked me what the ingredients were  and if there were any chemicals in it. I turned the bag around and started to read the ingredients out to her. She grabbed the bag out of my hand, angrily said \"I could have done that myself \" and stormed off."}, {"author": "OkBobcat", "score": "1.0k", "created": "22 hours", "comment": "Working at a state park in Maine:\n\nWhen do deer turn into moose?"}, {"author": "swank_sinatra", "score": "484", "created": "21 hours", "comment": "IT, got a ticket from a lady saying her screen is blank. I call, because I saw her in orientation and to be honest she seemed to have never used a computer before (despite being 19, and her title as a receptionist).\n\n\n\"Ma'am is your computer on?\"\n\n\"I don't know, how would I check?\"\n\n*coworker next to her grunts and turns on computer for her*\n\n\"Oh! Ok it's on, now do I have to type out my username AND password to log on?\"\n\n\".............................\"\n\n\nNo words could properly describe how I felt in that moment."}, {"author": "iwouldhugwonderwoman", "score": "978", "created": "21 hours", "comment": "I worked at a convenience store while in college.  This married couple comes in and they go get drinks.  The lady asks me if the bottle water is fat free.  I smile and just, yes and that brand is also calorie free.  She smiled and said thanks.  Her husband gets out his wallet, shakes his head, and pays."}, {"author": "OrderOfZune", "score": "2.4k", "created": "1 day", "comment": "Customer: \"What's my Facebook password?\""}, {"author": "buymepizza", "score": "3.3k", "created": "22 hours", "comment": "I used to work in IKEA in the section which sold wardrobes. Big behemoths of things. Normally around 6 foot long and 60kg in boxes. Customers would regularly ask me would it fit in their car. After being polite the first few times asking them about the size of their car and guessing, I then just started asking them what colour their car was. The amount of people who'd answer unphased was amazing."}, {"author": "CitizenTed", "score": "2.2k", "created": "21 hours", "comment": "Years ago, before the Internet was a thing, I worked in a small electronics shop. One day I got a phone call and it went like this: \n\nHim: Yeah, hi. I was just wondering...how far is it to your shop? \n\nMe: (Long pause, calculating how galactically stupid this question was, whether I was being pranked, and how a professional business person would handle this.) \n\nMe: Oh, it's just a few miles away. Come on down. \n\nHim: OK. See you soon. \n\nFollow-up: No idea if he ever actually arrived. I got busy and people came and went all day. But it was still the dumbest question I've ever received."}, {"author": "SunOnTheInside", "score": "1.1k", "created": "20 hours", "comment": "I sell stamps from my register at work. This was just a few days ago, actually. I had a lady come up and ask to buy some postal stamps. \n\nI asked her, “how many stamps would you like? We sell them in books of 2, 10, and 20.”\n\nHer: “...what? What does that mean?”\n\nMe: “it’s just the number of stamps in the book. Do you want 2, 10, or 20 stamps?”\n\nHer: (suddenly getting angry) “I don’t know what that means. What is a stamp? I don’t know what a stamp is”\n\nMe: ???\n\nI eventually sold 20 stamps to her while she was vaguely hostile and suspicious about the entire concept of stamps and stamp quantities? I don’t know how to explain this to you, lady, you’re the one who came to me for stamps."}, {"author": "herpty_derpty", "score": "1.7k", "created": "1 day", "comment": "\"What time do you close today?\"\n\n\"We're open 24/7.\"\n\n\"Oh great! And what time do you close tomorrow?\""}, {"author": "ayechihuahuas", "score": "691", "created": "22 hours", "comment": "Customer: Aren't those apples $2.49 a pound? Why are you charging me more than that?\n\nMe: \\*motions to screen\\* Yep. They're $2.49 a pound and you bought 2.3 pounds and so, the price is correct because that's how multiplication works."}, {"author": "FakingGumption", "score": "690", "created": "22 hours", "comment": "I worked at a Dollar Tree on Black Friday. \"where are your Black Friday deals?\" \"We don't have any. Everything is still a Dollar.\" People were pissed."}, {"author": "LimitedTimeOtter", "score": "1.8k", "created": "23 hours", "comment": "I work in a security monitoring call center. A coworker called a customer to inform them of an AC loss for their security system. We usually just say \"hey your power is out\" or something to that effect (but more professional-sounding obviously) because most of our customers don't know what AC means and they get very confused. Well, this coworker said \"AC loss\" on the customer's voicemail for some ungodly reason despite knowing better. The customer returned the call a few hours later. I picked up.\n\n\n&amp;nbsp;\n\n\n**Me**: Can I help you?\n\n\n**Her, panicking, sounding on the verge of tears**: Oh I *hope* so! I got a call that there's an AC loss at my house! \n\n\n**Me**: Ok, I can--\n\n\n**Her**: I'm out of town and I was having trouble with my air conditioner before I left...\n\n\n**Me, seeing where this is going**: Well, \"AC loss\" just means--\n\n\n**Her**: *DOES THIS MEAN THERE'S NO AIR IN MY HOUSE?!*"}, {"author": "Hysterical_Realist", "score": "324", "created": "19 hours", "comment": "Web developer here.\n\nI had a client who was absolutely *livid* -- literally screaming at me -- when I told her she couldn't take the hyperlinked words from her webpage, transfer them over to her print ad, and still have them function like a link."}, {"author": "UnderlordZ", "score": "1.6k", "created": "23 hours", "comment": "&gt;Do you have Raisin Bran, but without the raisins?\n\nBran flakes?\n\n&gt;No, that’s not it..."}, {"author": "tattoosandbacon94", "score": "1.2k", "created": "24 hours", "comment": "Used to work at a car parts store. Customer walks in and asks if vegetable oil was better than regular engine oil and what isle it was on"}, {"author": "CaptValentine", "score": "536", "created": "21 hours", "comment": "I had a customer take up 10 minutes of my time saying that I didn't know how to do my job because I couldn't find the \"nutritional facts\" placard on a carton of cigarettes.\n\nWhy, you who walk around with your head full of brains, may ask?\n\nShe needed, NEEDED, to know if these Timeless Times pieceoshit cigarettes contained corn syrup in them. Because, dontchaknow, the corn syrup in bad for her."}, {"author": "masu94", "score": "1.2k", "created": "1 day", "comment": "Are you really going to give me a plastic fork? One of the prongs could break off, stab me in the throat, and I'll DIE!\n\n-Worked at Arby's"}, {"author": "PubScrubRedemption", "score": "745", "created": "1 day", "comment": "I sell precast concrete structures (manholes, septic tanks, etc.) and some times we get calls from folks all over the US looking for stuff while we only deliver in New England; anywhere else and shipping is your problem. Normally when I explain this to those people they accept and look elsewhere.\n\nOne time this person wanted me to quote a single catch basin for a job in California. Telling them we're in New England didn't even phase them and they were persistent until I fully laid out the scope of shipping *6,000lbs of concrete across the continental US* when they could easily find the same product several towns over."}, {"author": "2ezyo", "score": "2.4k", "created": "1 day", "comment": "Many years ago I worked at Home Depot. \n\nOne time I had a customer come up and ask me how to access the parking lot that's on the roof. \n\nI told him that we didn't have a parking lot on the roof. \n\nHe didn't believe me, got super pissed off, and stormed out of the store to look for the access to the rooftop parking lot.\n\n__\n\n\nAnother time I had a customer looking for a replacement cartridge for a faucet that he didn't have with him. If you don't know, there's literally hundreds of different types of cartridges. \n\nAnyway, I asked him what make and model of faucet he had, and he responded with:\n\n\"You're the one that works in the plumbing department. YOU TELL ME.\" \n\nI told him that there's absolutely no way I could know what type of faucet he had in his home. The guy labelled me as racist and then stormed off.\n\n\n__\n\nAnother time I had a customer come up and ask me where the cat food was."}, {"author": "the-magnificunt", "score": "1.1k", "created": "24 hours", "comment": "I work in IT and one day received a ticket from a customer very angry that a link on our website was broken. When I asked what the link was to or where it was trying to go (because our site has thousands of pages), they were incensed that I dared to ask them questions and wouldn't just fix it immediately. Sure, dude, I'll get right on checking the hundreds of thousands of links on our site and hope I find the one you clicked on in the next 3 minutes because you refuse to give me more information.\n\nThey complained to my manager."}, {"author": "purpleinme", "score": "2.0k", "created": "1 day", "comment": "I worked at a hat store and a guy asked if he could shrink his hat by microwaving it. I said no. He came back two days later to return his hat after microwaving it. Problem was there was a hole in the front of it because Brewers hats are made with metallic threading. \n\nTL;DR Motherfucker microwaved his Brewers hat and blew a hole in it."}, {"author": "Z0MBGiEF", "score": "1.6k", "created": "22 hours", "comment": "Used to work at a movie store in the early 2000s, this dude with a thick accent kept calling in every other few weeks or so asking if we had this movie on DVD called \"Churro Man\"\n\nI mean this guy called a lot, and I told him that no such movie existed in our system but he was adamant he'd seen it on a release schedule. \n\nFinally a couple of months later, some guy walked up to me and asks me for the movie.  I immediately recognize the voice and know who it is, after a few questions in person I realized what the movie was all along.  The whole time he'd been looking for True Romance and it had indeed just come out on DVD, the accent threw me off.\n\nTurns out it wasn't a dumb question and that I in fact was the dumb one."}, {"author": "Cloaked42m", "score": "827", "created": "22 hours", "comment": "Absolute dumbest thing I've ever heard from a customer.  (obviously this is pre-GPS)\n\nWorked at a convenience store that was the first gas station once you reached an island.  This was at the end of I40, so it wasn't too uncommon for people to miss a turn onto 17, realize they'd just crossed a bridge onto an island and stop for directions.\n\n1st  Lady came in, asked directions to Island B.  Told her to go back across the bridge.\n\n\"What Bridge?\"\n\n\"The one you came across to get here.\"\n\n\"I didn't cross a bridge.\"\n\n\"Uh, okay, so you came across by ferry?\"\n\n\"No.  I didn't come on a ferry, and I didn't cross a bridge, and I'm NOT on an Island!!!\"\n\n...  We sent her 10 miles to the end of the island to make her take the ferry that wouldn't start running for another 2 hours.  It was the only answer she'd accept.\n\n2nd one.\nPoor guy came in looking for 95 South.  Told him how to get to it.  Raised an eyebrow . . . asked him where he'd come from.  He answered with a town an hour on the OTHER side of 95.  He'd missed his turn by 2 hours.  And had to go tell his girlfriend/SO in the car.  You could hear her screaming through the car and store windows."}, {"author": "simplerthings", "score": "1.2k", "created": "22 hours", "comment": "I thought it was the dumbest thing but it turned out not to be. \n\nI was working at a department store and this guy comes up to me and he shows me two of the exact same sweater. He's like, \"Which one is burgundy?\" They were both burgundy because they are the exact same sweater and I'm like... what is this dude smoking? Or I thought I was being punked or something. And he sees me hesitating and he's like, \"Like... which one is more wine-red?\" So finally I just point at one and he's like, \"Oh, thank you so much. I'm colorblind and I can't really distinguish this range of color.\""}, {"author": "Oinklittlepig", "score": "209", "created": "21 hours", "comment": "Not me, but a friend of mine worked on a boat tour. \n\"Excuse me Miss, how far above sea level are we?\"\n*looks over the side of the boat* \"Well, I would guess about 3 feet\""}, {"author": "CumgarTheUnkillable", "score": "747", "created": "23 hours", "comment": "I had a customer asked me where we sold alcoholic water. Not hard seltzer, literally bottled water with alcohol in it. She refused to believe me when I told her we didn’t sell it and proceeded to ask three other people where it was."}, {"author": "S3simulation", "score": "2.0k", "created": "1 day", "comment": "“I’d like the sirloin, medium rare with no pink.” Literally my first week on the floor waiting tables. \n\nAlso “you charge for drinks from the bar? Why didn’t you tell us?”\n\nMy favorite is when a guy asked what we charge per 2oz shot compared to the cost of the bottle and then said we were ripping him off. I really wanted to condescendingly explain capitalism to him but I didn’t have time"}, {"author": "thekillercook", "score": "747", "created": "1 day", "comment": "Working at a famous Mouse based theme park \"Can you shut off the rain now\" \"is there pork in the pulled pork sandwich?\""}, {"author": "TwistMeTwice", "score": "856", "created": "1 day", "comment": "No lie, I volunteer at Stonehenge and was asked when in the Bible it was created. That was more perplexing than the usual UFO questions."}, {"author": "Jenkem_of_the_Masses", "score": "1.5k", "created": "23 hours", "comment": "I was working at a convenience store/gas station in high school. I guy walks in on a Sunday morning and asks if we sell newspapers.\n\nMe: \"We have a box out front. You walked right past it.\"\n\nCustomer: \"Are there any in it?\"\n\nMe: \"I don't know, you'll have to check.\"\n\nCustomer: *looks at the box* \"I can't tell, there's one in the way.\"\n\nMe: \"Then there is at least one in there.\""}, {"author": "muffin5492", "score": "173", "created": "21 hours", "comment": "*\\*customer walks in the front door (company name on the door he opened), looks around, sees me\\** \"Am I in the right place?\"\n\nI don't know buddy; you tell me."}, {"author": "bloodectomy", "score": "504", "created": "20 hours", "comment": "\"why doesn't my app make any money for me? it is published and people are installing it!\"\n\napp price: free\n\nin-app purchases: none\n\nads: none\n\ngee guy, I fucking wonder."}, {"author": "naturalblue", "score": "173", "created": "17 hours", "comment": "This will be buried but hopefully it makes someone laugh. Worked at an animal hospital and a woman made an appointment for her dog for lumps on his stomach. \n\nShe comes in, sees the doctor, only to be told that the strange lumps were the dogs NIPPLES.\n\nShe dead ass said, \"But he's a boy!\" \n\nApparently she has either never seen a man without a shirt or forgot that males also have nipples"}, {"author": "Rockygurl106", "score": "497", "created": "22 hours", "comment": "I used to work at a Turkish kebab/fish and chip shop with a wee sandwich cabinet. \n\nA customer asked if she could have a ham sandwich and I told her that we didn't sell pig products as we were a Halal store.\n\nShe than said \"ok in that case can I have a bacon and egg sandwich?\"\n\nNo."}, {"author": "StylishSuidae", "score": "1.2k", "created": "1 day", "comment": "It wasn't a question, but I once had a customer threaten that she'd \"never shop here again!\"... two weeks before the store closed for good. There were signs all over the store and this was pretty big news in the city so there was no way she didn't know how empty her threat was."}, {"author": "Skydog07", "score": "334", "created": "22 hours", "comment": "(Answering phone calls at local zoo)\n\n\"So what do ya do, come in and look at animals?\""}, {"author": "migmaster135", "score": "161", "created": "23 hours", "comment": "They didn't ask me, but I once heard someone ask if the bacon cheeseburger was vegetarian."}, {"author": "UteSchnute", "score": "162", "created": "20 hours", "comment": "I worked ar Starbucks and a man asked for a chocolate frappuccino (iced drink) and a hot chocolate. When I gave them to him, he asked which was which..."}, {"author": "Portarossa", "score": "983", "created": "24 hours", "comment": "I write erotica for a living. I have, on a number of occasions, received emails from people telling me how much they enjoyed my stories and asking what happened to me afterwards. I usually assume that they're just looking for a little bit of bespoke pro ~~boner~~ bono jerkoff material, but some of them seem to genuinely not grasp the fact that *they're fictional stories*. That I made up. With my brain-meat. For money.\n\nI got into a discussion with one guy early on who wouldn't let the idea that I was just writing up my sexual misadventures drop. I even pointed out that the girl in the story had a different name to me, at which point he replied: 'I just thought you were shy.'\n\nHe genuinely seemed to believe that I'd written up something like an eight-person true-to-life BDSM gangbang scene (or whatever it was), but I hadn't put my pen name on it (not even my real name, my pen name) because I'd suddenly come over all bashful."}, {"author": "WooIWorthWaIIaby", "score": "1.5k", "created": "1 day", "comment": "I worked at staples and I had a customer ask if the printer toner was 'ethically sourced'.\n\nThis lady really thought laser printer toner was squeezed out of squids or some shit"}, {"author": "Iggy363", "score": "857", "created": "1 day", "comment": "Standing next to a pallet of eggs, with boxes of eggs in my hand and freshly unloaded ones on the shelf in front me. \"Do you sell eggs?\""}, {"author": "BrokeWhiteGuy", "score": "751", "created": "1 day", "comment": "One of my very first jobs was a stocking associate for Petsmart. Had a customer one time ask me if we have any blue Buffalo brand dog food that has no “pro van” in it, As she doesn’t want to change up her dogs diet because it hurts his stomach. I had absolutely no idea what she was talking about so I offered to help her find the proper food, when we get to the aisle she points out blue Buffalo and says “it seems like they change the recipe because they all have Provan in it”\n\nOn the bag it actually said “proven best recipe.” This idiot actually thought the word proven was an ingredient lol. I explain that the recipe is the same and they just used new packaging, and it seemed to go in one ear out the other as she said she would go to another store to see if they carry the proper brand."}, {"author": "Sven_88", "score": "411", "created": "1 day", "comment": "Worked at a restaurant that sold chicken wings. We had just begun selling boneless wings. A lady asked me what was inside the boneless ones. I thought she was joking so I just said chicken."}, {"author": "PandoraJeep", "score": "139", "created": "21 hours", "comment": "Wasn't so much one question, as a serious of questions in which I had to explain to a grown ass woman that I can't just make a key for her house without either the lock (wasn't a locksmith, but we had one on site) or a key to duplicate. She wanted me to make her house key from a key to a different house that \"looked the same\" (they were just both KW1 keys). After about 20 minutes I finally convinced her to bring me the correct key to duplicate. It was special."}, {"author": "sadpanda___", "score": "394", "created": "21 hours", "comment": "Karen - \"I'd like to speak to the manager\"\n\nMe - \"I am the manager.....and the only person working here today\"\n\nKaren - \"I don't like this policy.  I want to speak to the owner\"\n\nMe - \"Good luck with that.  Their email is on the company cards available on the desk.  And I'll include my cell number.....just because I'm interested to hear how it goes for you\"\n\nOh boy did I get a pissed off text from her later that night hahaha"}, {"author": "Lipovaccc", "score": "492", "created": "1 day", "comment": "It was not a question, but one time guy told me his car engine was overheating..\nSo i checked the engine and saw that everything was just fine..\nI asked..why do you think it's overheating?\nHe said...it burned my hand when i was touching it.."}, {"author": "sebrebc", "score": "266", "created": "21 hours", "comment": "Many years ago managing a pet store, a customer came in with an empty bottle of oral skin and coat supplement. He wanted a refund because it made his dog's coat really greasy.  So as I start working on his refund I ask a few questions, trying to find out why the product failed. I ask the standard questions, did you use too much, how often. Stuff like that.\n\nAs we are conversing it started to click that he didn't use this on his dogs food he used it like a shampoo and rubbed it on his coat. So I nicely explain that it is *oral* skin and coat supplement and it's intended to be put on the dog's food.\n\nHe was embarrassed and apologized and started to leave refusing the refund. I gave him a new bottle in exchange for the now empty one and told him to give it another shot.\n\nThe guy was really nice and understanding about it, but come on. The instructions tell you how much to put ON THE FOOD, and it's called *oral* skin and coat."}, {"author": "Cryoarchitect", "score": "258", "created": "1 day", "comment": "\"Can I return the box for a full refund?  The thing was stolen so I don't have any use for it now.\"  \n\nUmm, not here, no.  Call your insurance company."}, {"author": "FalstaffsMind", "score": "564", "created": "1 day", "comment": "I must look like some kind of DIY authority, because people ask me questions at Home Depot fairly often, and I don't work there, nor do I have any orange on."}, {"author": "meri_28", "score": "335", "created": "23 hours", "comment": "I used to work the front desk of 24 hour fitness making minimum wage, and a young woman was upset because I wouldn't let her heat up some food after her workout and then eat it in the staff break room. I was nice enough to store her food in the refrigerator for her when she brought it in before her workout. She actually walked into the break room and was like \"I'm going to use your microwave and eat this.\" I told her no, so she was like \"Well can you heat this up for me?\" I told her no again, and she just genuinely didn't understand why."}, {"author": "-merel-", "score": "230", "created": "23 hours", "comment": "I worked as a cashier at a supermarket and someone said that the prices in the store are high. She then asked if I could do something about it"}, {"author": "ThouReaper", "score": "324", "created": "1 day", "comment": "\"Do you guys serve spaghetti?\" I work at a Jimmy John's. We dont even heat up the subs. He was a semi regular customer too"}, {"author": "MaybeNotABear", "score": "314", "created": "23 hours", "comment": "I used to work at a retail nursery in the tree and shrub department. I had a customer tell me to extra water a bush he was buying because he didn't want to have to water it until he planted it in two weeks"}, {"author": "ecitruoc", "score": "111", "created": "20 hours", "comment": "Worked in retail.\n\nRegularly had customers ask to take the clothes out of the store and come back and pay later.\n\nLike... absolutely not? Most were also flabbergasted when I told them no."}, {"author": "Thorneto", "score": "298", "created": "22 hours", "comment": "Some guy walked into my store, I worked in a mall, and asked if I knew where the dolphin with a toothbrush was. He just kept saying dolphin with toothbrush and we thought he was mad. When I left my shift that day I noticed the dentist around the corned in fact had a dolphin with a toothbrush on the sign. I'll never forget that interaction though."}, {"author": "shit-over-it", "score": "207", "created": "20 hours", "comment": "Will Anne Frank give the tours herself in the attic museum? [Talking about the Anne Frank Museum in Amsterdam]\n\nYeah. Thats not a joke. Someone actually asked that and was completely serious."}, {"author": "Nesta930", "score": "291", "created": "23 hours", "comment": "Is the fire of your pizza oven organic ?"}, {"author": "carpentim", "score": "197", "created": "22 hours", "comment": "\"Can I help you?\" as I was walking up to ask them the same thing. Felt like I was in the twilight zone."}, {"author": "meta_uprising", "score": "505", "created": "1 day", "comment": "Often I say let me Google that then I put them on hold a minute just to let it sink in"}, {"author": "stoic_minotaur", "score": "961", "created": "1 day", "comment": "Customer: \"Why is it so dark outside all of a sudden?!?\"\n\nMe: \"The sun went down, mam\""}, {"author": "ky0nshi", "score": "93", "created": "21 hours", "comment": "\"Are you open?\"\n\nSo many, many people asked the same stupid fucking question. There was a sign with Open on it next to the window. There were people waiting for the next tour there. They just saw me take money in exchange for tickets. They waited behind half a dozen other people in line to ask me that.\n\nNo, I wanted to tell them. I come here on my days off and stare out of this tiny window for fun. It's how I roll."}, {"author": "Youpunyhumans", "score": "676", "created": "1 day", "comment": "Had a homeless woman try to buy vodka with old recipts and random business cards and such. I had to explain that the dollar amount on an old recipt is not currency and cannot be used to pay for something."}, {"author": "tubatim817", "score": "178", "created": "24 hours", "comment": "If a bacon cheeseburger comes with cheese on it"}, {"author": "Steffany_w0525", "score": "175", "created": "22 hours", "comment": "Worked at Starbucks. A guy requested \"extra macchiato\" on his caramel macchiato. I looked at him and asked \"You want me to extra mark the foam?\". Then he looked at me and asked what macchiato even was."}, {"author": "rockinout2silence", "score": "177", "created": "22 hours", "comment": "\"Why can't I buy the Wii for the sale price? It says it's on sale here in the ad.\" *points*\n\n\"I know, I'm sorry, but as I said, sir, we sold out. We have no more Wii in stock.\"\n\nHe then proceeded to berate our entire staff and yell about he made $25/hr and we were all losers. I hate holiday season in retail."}, {"author": "whiteknight804", "score": "80", "created": "22 hours", "comment": "My first Christmas Eve working retail I had a customer ask for a LEGO set that the store was out of. I politely told him this and he followed up with does another store have it and I informed him that no store within 150 mile had it. His finale question was if we were going to be getting anymore before Christmas and I told him no again. Now, this wouldn’t have been so bad, except, he came back and repeated the three questions every half hour."}, {"author": "attemptedeffort", "score": "230", "created": "23 hours", "comment": "I'm a chef at a grill. We also have a buffet for people who don't want something we grill. \n\nOne night, the special was a type of seasoned fish. An old guy came up and asked \"is this freshly caught?\" I thought he was kidding so I kind of chuckled as I told him that no, we order it and get it frozen. He was pissed and made a scene as he left saying that only a crappy restaurant served frozen fish. \n\nI was in south-central Pennsylvania"}, {"author": "pm_me_your_taintt", "score": "772", "created": "1 day", "comment": "Lady walks into the empty restaurant, looks around, asks \"is this a furniture store?\""}, {"author": "Fall-Risk", "score": "164", "created": "22 hours", "comment": "I once had a customer ask me if our wine was on sale because it was about to expire. Our good, aged red wine.\n\nEDIT: the customer also insisted that she get a discount because the wine bottle did not have an exp. Date.."}, {"author": "Triangle_Graph", "score": "162", "created": "22 hours", "comment": "*hands me bag of gummy worms*\nHer: are there chemicals in this?\nMe: yes\n*hands me bag of plantain chips*\nHer: what about this? It’s natural!\nMe: ma’am, there’s chemicals in everything\nHer: fine! I’m just take this then\n*hands me a bottle of diet coke*"}, {"author": "mimieieieieie", "score": "212", "created": "1 day", "comment": "\"The line is huge, and this thing is not expensive at all. Can you give it to me for free?\""}, {"author": "Louise-Bb", "score": "204", "created": "23 hours", "comment": "I’d actually been working my first summer job at 14-years old. It was in a cafe which was busy and hectic at the time. Anyway, a middle-aged woman walks in and asks for a milkshake. \nEasy,\n\nHer:Could I please have a milkshake\n\nMe:Of course would you like chocolate or-\n\nHer: but I’m vegan, so could you please make it with soy milk - do you have soy milk?\n\nMe:umm, I’m afraid we have run out, but we have almond milk\n\nHer:I don’t like almond milk - I just told you, I’m vegan ( pissed off at this point)\n\nMe:I’m sorry, but we don’t have anything else\n\nHer:Okay, then just do it without the milk - that should cost less, too, right?\n\n...\n\nShorter version: Woman asked for a milkshake without the milk and then proceeded to ask us to knock money off the drink since there wouldn’t be milk in it."}, {"author": "hononononoh", "score": "264", "created": "1 day", "comment": "\"Do I have to, like, pay for this?\""}, {"author": "Laughingfoxcreates", "score": "319", "created": "23 hours", "comment": "Worked in a pet store that got tadpoles in occasionally. \n\n“Do these become frogs?”\n\nYes Ma’am.\n\n“Do you have the kind that just stay tadpoles forever?” \n\n........"}, {"author": "superaxia", "score": "184", "created": "23 hours", "comment": "\"do you guys have sushi?\"\n\nThis was when I worked at Panera Bread."}]}